constant/thermalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermalProperties;
}

kf                           kf [1 1 -3 -1 0 0 0] 0.61;
ks                           ks [1 1 -3 -1 0 0 0] 237;
rhof                       rhof [1 -3 0  0 0 0 0] 1000;
rhos                       rhos [1 -3 0  0 0 0 0] 2700;
cpf                         cpf [0 2 -2 -1 0 0 0] 4180;
cps                         cps [0 2 -2 -1 0 0 0] 880;
Qvalue                   Qvalue [1 -1 -3 0 0 0 0] 100000000;
Talpha                   Taplha [0 0 0 -1 0 0 0] 2e-5;

Q_TYPE                1; // 1 FOR DASH 2 FOR SIN


