constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;
//fluid
nu                           nu [0 2 -1 0 0 0 0] 1.0e-6;
alphaMax               alphaMax [0 0 -1 0 0 0 0] 2.5e3;  //initial alphaMax/rho_f real alphaMax begin with 2.5e6
alphamax               alphamax [0 0 -1 0 0 0 0] 1e7;    //End alphamax/rho_f real alphaMax end with 1e10

// opt
raa0                   1e-5;
mma_init               0.3;
mma_dec                0.7;
mma_inc                1.2;
movlim                 0.4;

voluse                 0.4;
filter_Radius          2;
solid_area             0;
fluid_area             1;
test_PD                0;

D_normalization        2.89070e-08;//1.26717e-07;//1.33095e-07;// 1.57572e-07;
D0                     25;
D1                     10;
geo_dim                2;

b1                     b1 [-1 3 0 -1 0 0 0] 1;
qu                     0.005;
timecons               1.0;
